nxp-mcuxpresso/mcuxsdk-examples/_boards/imx952evk/driver_examples/xspi/octal/polling_transfer/cm7/pin_mux.c
/*
 * Copyright 2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v13.0
processor: MIMX9352xxxxM
package_id: MIMX9352DVUXM
mcu_data: ksdk2_0
processor_version: 0.13.4
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33}
- pin_list:
  - {pin_num: D20, peripheral: LPI2C2, signal: lpi2c_scl, pin_signal: I2C2_SCL, SION: ENABLED, HYS: DISABLED, OD: ENABLED, PD: DISABLED}
  - {pin_num: D21, peripheral: LPI2C2, signal: lpi2c_sda, pin_signal: I2C2_SDA, SION: ENABLED, OD: ENABLED, PD: DISABLED}
  - {pin_num: F21, peripheral: LPUART2, signal: lpuart_tx, pin_signal: UART2_TXD, OD: no_init, PD: DISABLED, PU: DISABLED, FSEL1: SlOW_SLEW_RATE}
  - {pin_num: F20, peripheral: LPUART2, signal: lpuart_rx, pin_signal: UART2_RXD, OD: DISABLED, PD: ENABLED, PU: DISABLED, FSEL1: SlOW_SLEW_RATE, DSE: NO_DRIVE}
  - {pin_num: V16, peripheral: XSPI1, signal: flexspi_a_sclk, pin_signal: SD3_CLK, PD: DISABLED, FSEL1: SlOW_SLEW_RATE, DSE: X4}
  - {pin_num: T16, peripheral: XSPI1, signal: 'flexspi_a_data, 00', pin_signal: SD3_DATA0, PD: DISABLED, FSEL1: SlOW_SLEW_RATE, DSE: X4}
  - {pin_num: V14, peripheral: XSPI1, signal: 'flexspi_a_data, 01', pin_signal: SD3_DATA1, PD: DISABLED, FSEL1: SlOW_SLEW_RATE, DSE: X4}
  - {pin_num: U14, peripheral: XSPI1, signal: 'flexspi_a_data, 02', pin_signal: SD3_DATA2, PD: DISABLED, FSEL1: SlOW_SLEW_RATE, DSE: X4}
  - {pin_num: T14, peripheral: XSPI1, signal: 'flexspi_a_data, 03', pin_signal: SD3_DATA3, PD: DISABLED, FSEL1: SlOW_SLEW_RATE, DSE: X4}
  - {pin_num: U16, peripheral: USDHC3, signal: 'flexspi_a_ss_b, 0', pin_signal: SD3_CMD, PD: DISABLED, FSEL1: SlOW_SLEW_RATE, DSE: X4}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {                                /*!< Function assigned for the core: Cortex-M33[cm33] */
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO15__LPUART3_RX, 0U);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO14__LPUART3_TX, 0U);

    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO15__LPUART3_RX,
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO14__LPUART3_TX,
                        IOMUXC_PAD_DSE(15U));

    IOMUXC_SetPinMux(IOMUXC_PAD_XSPI1_SCLK__XSPI1_A_SCLK, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_XSPI1_SCLK__XSPI1_A_SCLK,
                        IOMUXC_PAD_DSE(15U));
    IOMUXC_SetPinMux(IOMUXC_PAD_XSPI1_SS0_B__XSPI1_A_SS0_B, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_XSPI1_SS0_B__XSPI1_A_SS0_B,
                        IOMUXC_PAD_DSE(15U));
    IOMUXC_SetPinMux(IOMUXC_PAD_XSPI1_SS1_B__XSPI1_A_SS1_B, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_XSPI1_SS1_B__XSPI1_A_SS1_B,
                        IOMUXC_PAD_DSE(15U));
    IOMUXC_SetPinMux(IOMUXC_PAD_XSPI1_DQS__XSPI1_A_DQS, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_XSPI1_DQS__XSPI1_A_DQS,
                        IOMUXC_PAD_DSE(15U));
    IOMUXC_SetPinMux(IOMUXC_PAD_XSPI1_DATA0__XSPI1_A_DATA_0, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_XSPI1_DATA0__XSPI1_A_DATA_0,
                        IOMUXC_PAD_DSE(15U));
    IOMUXC_SetPinMux(IOMUXC_PAD_XSPI1_DATA1__XSPI1_A_DATA_1, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_XSPI1_DATA1__XSPI1_A_DATA_1,
                        IOMUXC_PAD_DSE(15U));
    IOMUXC_SetPinMux(IOMUXC_PAD_XSPI1_DATA2__XSPI1_A_DATA_2, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_XSPI1_DATA2__XSPI1_A_DATA_2,
                        IOMUXC_PAD_DSE(15U));
    IOMUXC_SetPinMux(IOMUXC_PAD_XSPI1_DATA3__XSPI1_A_DATA_3, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_XSPI1_DATA3__XSPI1_A_DATA_3,
                        IOMUXC_PAD_DSE(15U));
    IOMUXC_SetPinMux(IOMUXC_PAD_XSPI1_DATA4__XSPI1_A_DATA_4, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_XSPI1_DATA4__XSPI1_A_DATA_4,
                        IOMUXC_PAD_DSE(15U));
    IOMUXC_SetPinMux(IOMUXC_PAD_XSPI1_DATA5__XSPI1_A_DATA_5, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_XSPI1_DATA5__XSPI1_A_DATA_5,
                        IOMUXC_PAD_DSE(15U));
    IOMUXC_SetPinMux(IOMUXC_PAD_XSPI1_DATA6__XSPI1_A_DATA_6, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_XSPI1_DATA6__XSPI1_A_DATA_6,
                        IOMUXC_PAD_DSE(15U));
    IOMUXC_SetPinMux(IOMUXC_PAD_XSPI1_DATA7__XSPI1_A_DATA_7, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_XSPI1_DATA7__XSPI1_A_DATA_7,
                        IOMUXC_PAD_DSE(15U));
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
